// NPC Dialogue for HTR quest
{
    // GENERIC VILLAGER DIALOGUE 
    "HTR.VillagerDialogue.01": "I had the strangest dream last night",
    "HTR.VillagerDialogue.02": "It's kinda quiet without Vincent around. I hope they wake up soon.",
    "HTR.VillagerDialogue.03": "Ugh, I had to drag myself out of bed this morning.",
    "HTR.VillagerDialogue.04": "Wish I could sleep the day away, but there's too much to do.",
    "HTR.VillagerDialogue.05": "Glad to see you up and about. I almost didn't get out of bed myself, this morning.",
    "HTR.VillagerDialogue.06": "Don't worry. I'm sure Jas will wake up before you know it.",
    "HTR.VillagerDialogue.07": "I like to sleep with a dream catcher. Keeps the bad dreams at bay",

    // DREAM WORLD DIALOGUE - Location based
    "HTR.DreamworldDialogue_Vincent.01": "Woah this place is crazy. I could stay here forever!",
    "HTR.DreamworldDialogue_Jas.01": "Wow...I wonder what kind of cute animals are here.",

    // GENERIC VANA DIALOGUE
    "HTR.VanaDialogue.01": "Sometimes, I wish I could stay here forever...Endlessly dreaming a good dream.",
    "HTR.VanaDialogue.02": "Lord Somnia's bad at making friends, but he's a pretty sweet guy once you get to know him.",
    "HTR.VanaDialogue.03": "Dreams can be a lot better than reality.",
    "HTR.VanaDialogue.04": "The Dream World can be dangerous sometimes, so make sure you have the right tools.",

    // GENERIC LORD SOMNIA DIALOGUE
    "HTR.LordSomniaDialogue.01": "The best way to fight a nightmare is to look it right in the eyes.",
    "HTR.LordSomniaDialogue.02": "I'm the Lord of Dreams but sometimes I wish I was a god...Then I could make everyone's dream a reality.",
    "HTR.LordSomniaDialogue.03": "Your determination to help is admirable",
    "HTR.LordSomniaDialogue.04": "Do come back, human. I'm counting on you.",

    // HARVEY HOSPITAL QUEST DIALOGUE
    "HTR.HospitalEvent_Harvey.01": "@! Glad you're healthy and awake.",
    "HTR.HospitalEvent_Harvey.02": "Jas and Vincent are sleeping...No amount of shaking, prodding or yelling will wake them.",
    "HTR.HospitalEvent_Harvey.03": "$s I've examined them thoroughly and nothing's wrong with them medically. They're just...asleep!",
    "HTR.HospitalEvent_Harvey.04": "Anyway, I've been checking in with everyone to make sure they're okay.",
    "HTR.HospitalEvent_Harvey.05": "Since you're here, would you mind doing me a favor? Could you go talk to the Wizard?",
    "HTR.HospitalEvent_Harvey.06": "$s I feel a little out of my depth. He might know what's going on.",

    // WIZARD TEDDY BEAR QUEST DIALOGUE
    "HTR.TeddyEvent_Wizard.01": "Ah yes, I was expecting you.",
    "HTR.TeddyEvent_Wizard.02": "It's unfortunate what's happening to Vincent and Jas",
    "HTR.TeddyEvent_Wizard.03": "Sleeping without protection can be dangerous...Especially for children",
    "HTR.TeddyEvent_Wizard.04": "All these questions. Be patient and you will have your answers",
    "HTR.TeddyEvent_Wizard.05": "Rest assured, I will be alright. But you are vulnerable",
    "HTR.TeddyEvent_Wizard.06": "Here...Take this. Keep it with you while you sleep.",
    
    /*******************************
    DREAM WORLD SPAWN EVENT DIALOGUE
    ********************************/
    "HTR.DWSpawnEvent_Vanna.01": "Oh! Another Dreamer! That makes three this week.$4",
    "HTR.DWSpawnEvent_Vanna.02": "The other two are playing around here somewhere...I think their names were Jas and Vincent.",
    "HTR.DWSpawnEvent_Vanna.03": "Well, yes. We all are...This is the Dream World after all. Kind of hard to dream if you're awake.",
    "HTR.DWSpawnEvent_Vanna.04": "Almost forgot...my name is Vanna...Don't worry, you'll get used to staying here eventually.",
    "HTR.DWSpawnEvent_Vanna.05":"Hmm...Leaving can be a little difficult.",
    "HTR.DWSpawnEvent_Vanna.06":"But if you have your heart set on it, you could always ask Lord Somnia for help. Though I'm not sure why anyone would want to leave.",
    "HTR.DWSpawnEvent_Vanna.07":"LORD SOMNIA!!",
    "HTR.DWSpawnEvent_Vanna.08":"This is @, they wanted to leave.",

    "HTR.DWSpawnEvent_DreamLord.01":"$2 Must you scream so loudly?",
    "HTR.DWSpawnEvent_DreamLord.02":"Oh? Who's this? Another human?",
    "HTR.DWSpawnEvent_DreamLord.03":"Well...under normal circumstances, leaving would be a challenge but you seem to bear protection.",
    "HTR.DWSpawnEvent_DreamLord.04":"The same way you enter my realm is the same way you leave it...just sleep.",
    "HTR.DWSpawnEvent_DreamLord.05":"The children...now that is a different matter. Come with me.",
    "HTR.DWSpawnEvent_DreamLord.06":"Children do not process the world as adults do. They have a harder time differentiating dreams from reality. Here, they'll stay until they are ready to leave.",
    "HTR.DWSpawnEvent_DreamLord.07":"I could not say...It's possible they wake up tomorrow...or they could be like Vanna and choose to stay for years.",
    "HTR.DWSpawnEvent_DreamLord.08":"Normally, I would have no problem waking them up and sending them back to their parents. But I'm afraid my powers aren't what they used to be.",
    "HTR.DWSpawnEvent_DreamLord.09":"Perhaps...Yes. Human, a few years ago I misplaced my regalia. There artifacts that can help boost my power. I'm too busy to search for them, but you on the other hand...",
    "HTR.DWSpawnEvent_DreamLord.10":"Collect my regalia and I'll wake the children for you.",
    "HTR.DWSpawnEvent_DreamLord.11":"Speak to Vanna, she can supply you with tools before you begin",


    /*******************************
    DREAM WORLD BOSS BATTLE DIALOGUE
    ********************************/
    "HTR.DwBossEvent_DreamLord.01": "I must extend my thanks, @. I can now entice more dreamers and trap them here.",
    "HTR.DwBossEvent_DreamLord.02": "Regrettably, Vanna's time is running out. I cannot save her but I can gather others to take her place.",
    "HTR.DwBossEvent_DreamLord.03": "Do not pretend like your world is better than mine. Here, you can be anything, do anything, dream anything.",
    "HTR.DwBossEvent_DreamLord.04": "@, I have grown fond of your presence"
    

}
